; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_16)

(:domain logistics)

(:objects
	obj0 obj5 - airport
	obj1 obj6 - city
	obj2 obj3 obj4 obj12 obj15 obj16 - location
	obj7 obj8 - truck
	obj9 obj10 obj11 obj13 - package
	obj14 - airplane
)

(:init
	(at obj7 obj0)
	(at obj8 obj5)
	(at obj9 obj0)
	(at obj10 obj5)
	(at obj11 obj2)
	(at obj13 obj3)
	(at obj14 obj5)
	(in-city obj0 obj1)
	(in-city obj2 obj1)
	(in-city obj3 obj1)
	(in-city obj4 obj1)
	(in-city obj5 obj6)
	(in-city obj12 obj6)
	(in-city obj15 obj6)
	(in-city obj16 obj6)
)

(:goal (and
	(at obj9 obj15)
	(at obj10 obj3)
	(at obj11 obj4)
	(at obj13 obj4)
))
)

; plan
1. (drive obj7 obj0 obj2)
   deleted: (at obj7 obj0)
   added: (at obj7 obj2)
   goals met: 0 of 4
2. (drive obj8 obj5 obj15)
   deleted: (at obj8 obj5)
   added: (at obj8 obj15)
   goals met: 0 of 4
3. (load obj14 obj10 obj5)
   deleted: (at obj10 obj5)
   added: (in obj10 obj14)
   goals met: 0 of 4
4. (fly obj14 obj5 obj0)
   deleted: (at obj14 obj5)
   added: (at obj14 obj0)
   goals met: 0 of 4
5. (drive obj8 obj15 obj16)
   deleted: (at obj8 obj15)
   added: (at obj8 obj16)
   goals met: 0 of 4
6. (load obj14 obj9 obj0)
   deleted: (at obj9 obj0)
   added: (in obj9 obj14)
   goals met: 0 of 4
7. (load obj7 obj11 obj2)
   deleted: (at obj11 obj2)
   added: (in obj11 obj7)
   goals met: 0 of 4
8. (unload obj14 obj10 obj0)
   deleted: (in obj10 obj14)
   added: (at obj10 obj0)
   goals met: 0 of 4
9. (drive obj7 obj2 obj0)
   deleted: (at obj7 obj2)
   added: (at obj7 obj0)
   goals met: 0 of 4
10. (fly obj14 obj0 obj5)
   deleted: (at obj14 obj0)
   added: (at obj14 obj5)
   goals met: 0 of 4
11. (drive obj8 obj16 obj5)
   deleted: (at obj8 obj16)
   added: (at obj8 obj5)
   goals met: 0 of 4
12. (load obj7 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj7)
   goals met: 0 of 4
13. (unload obj14 obj9 obj5)
   deleted: (in obj9 obj14)
   added: (at obj9 obj5)
   goals met: 0 of 4
14. (drive obj7 obj0 obj3)
   deleted: (at obj7 obj0)
   added: (at obj7 obj3)
   goals met: 0 of 4
15. (load obj7 obj13 obj3)
   deleted: (at obj13 obj3)
   added: (in obj13 obj7)
   goals met: 0 of 4
16. (load obj8 obj9 obj5)
   deleted: (at obj9 obj5)
   added: (in obj9 obj8)
   goals met: 0 of 4
17. (unload obj7 obj10 obj3)
   deleted: (in obj10 obj7)
   added: (at obj10 obj3)
   goals met: 1 of 4
18. (drive obj7 obj3 obj4)
   deleted: (at obj7 obj3)
   added: (at obj7 obj4)
   goals met: 1 of 4
19. (drive obj8 obj5 obj15)
   deleted: (at obj8 obj5)
   added: (at obj8 obj15)
   goals met: 1 of 4
20. (fly obj14 obj5 obj0)
   deleted: (at obj14 obj5)
   added: (at obj14 obj0)
   goals met: 1 of 4
21. (unload obj7 obj11 obj4)
   deleted: (in obj11 obj7)
   added: (at obj11 obj4)
   goals met: 2 of 4
22. (unload obj7 obj13 obj4)
   deleted: (in obj13 obj7)
   added: (at obj13 obj4)
   goals met: 3 of 4
23. (unload obj8 obj9 obj15)
   deleted: (in obj9 obj8)
   added: (at obj9 obj15)
   goals met: 4 of 4
